{
  "1": {
    "id": "1",
    "title": "Smith v. Bayersche Motors",
    "status": "won",
    "jurisdiction": "California",
    "caseType": "Liability",
    "date": "2023-05-15",
    "relevantLaws": [
      "California Vehicle Code § 27315",
      "California Civil Code § 1793.2"
    ],
    "timeline": [
      {
        "date": "2023-01-10",
        "event": "Initial complaint filed",
        "description": "Plaintiff filed complaint alleging faulty braking system"
      },
      {
        "date": "2023-02-15",
        "event": "Response filed",
        "description": "Bayersche Motors filed response denying allegations"
      },
      {
        "date": "2023-03-20",
        "event": "Discovery phase",
        "description": "Exchange of documents and expert testimonies"
      },
      {
        "date": "2023-04-25",
        "event": "Court hearing",
        "description": "Judge ruled in favor of Bayersche Motors"
      },
      {
        "date": "2023-05-15",
        "event": "Case closed",
        "description": "Case officially closed with favorable outcome"
      }
    ],
    "offenseArgumentation": "The plaintiff claimed that the braking system in the Model S was defective, causing a collision. They argued that Bayersche Motors was aware of the defect but failed to issue a recall or properly warn customers.",
    "defenseArgumentation": "Our defense demonstrated that the braking system met all safety standards and that the collision was caused by driver error rather than any defect in the vehicle. Expert testimony confirmed the braking system functioned as designed.",
    "suggestions": [
      "Reference the Johnson v. AutoCorp case where similar claims were dismissed",
      "Include more technical data from the vehicle's diagnostic system",
      "Emphasize driver training requirements in the owner's manual"
    ],
    "outcomePrediction": {
      "cost": "$150,000 - $250,000",
      "reputationalLoss": "Low",
      "winProbability": "85%"
    }
  },
  "2": {
    "id": "2",
    "title": "Johnson Family Trust v. Bayersche",
    "status": "lost",
    "jurisdiction": "New York",
    "caseType": "Liability",
    "date": "2023-08-22",
    "relevantLaws": [
      "New York Vehicle and Traffic Law § 375",
      "New York General Business Law § 349"
    ],
    "timeline": [
      {
        "date": "2023-03-05",
        "event": "Initial complaint filed",
        "description": "Plaintiff alleged engine defect causing fire hazard"
      },
      {
        "date": "2023-04-12",
        "event": "Response filed",
        "description": "Bayersche filed response contesting allegations"
      },
      {
        "date": "2023-05-20",
        "event": "Expert testimony",
        "description": "Expert witnesses testified about engine design"
      },
      {
        "date": "2023-07-15",
        "event": "Court ruling",
        "description": "Court ruled in favor of plaintiff"
      },
      {
        "date": "2023-08-22",
        "event": "Case closed",
        "description": "Settlement finalized and case closed"
      }
    ],
    "offenseArgumentation": "The plaintiff argued that the engine design in the Model X had a fundamental flaw that created a fire risk. They presented evidence of similar incidents and claimed Bayersche was negligent in addressing known issues.",
    "defenseArgumentation": "Our defense argued that the isolated incidents were due to improper maintenance rather than design flaws. We presented extensive testing data showing the engine design met all safety standards.",
    "suggestions": [
      "Consider early settlement in similar cases to avoid negative publicity",
      "Strengthen evidence of customer maintenance records",
      "Develop more comprehensive expert testimony on engine safety features"
    ],
    "outcomePrediction": {
      "cost": "$750,000 - $1,200,000",
      "reputationalLoss": "High",
      "winProbability": "30%"
    }
  },
  "3": {
    "id": "3",
    "title": "Martinez Product Liability Claim",
    "status": "in progress",
    "jurisdiction": "Texas",
    "caseType": "Liability",
    "date": "2024-01-10",
    "relevantLaws": [
      "Texas Transportation Code § 547.004",
      "Texas Deceptive Trade Practices Act"
    ],
    "timeline": [
      {
        "date": "2023-11-15",
        "event": "Initial complaint filed",
        "description": "Plaintiff alleges suspension system failure"
      },
      {
        "date": "2023-12-20",
        "event": "Response filed",
        "description": "Bayersche filed response denying allegations"
      },
      {
        "date": "2024-01-10",
        "event": "Discovery phase initiated",
        "description": "Exchange of documents and evidence begins"
      }
    ],
    "offenseArgumentation": "The plaintiff claims that the suspension system in the Model Y failed during normal driving conditions, causing a rollover accident. They argue that Bayersche was aware of design flaws but failed to address them.",
    "defenseArgumentation": "Our defense is focusing on the vehicle's maintenance history and road conditions at the time of the incident. We are gathering evidence to show the suspension system met all safety standards and was not defective.",
    "suggestions": [
      "Reference the Williams v. AutoTech case where similar claims were successfully defended",
      "Obtain detailed road condition reports from the accident scene",
      "Commission independent testing of the specific suspension components"
    ],
    "outcomePrediction": {
      "cost": "$300,000 - $500,000",
      "reputationalLoss": "Medium",
      "winProbability": "60%"
    }
  },
  "4": {
    "id": "4",
    "title": "Williams Class Action",
    "status": "in progress",
    "jurisdiction": "Florida",
    "caseType": "Liability",
    "date": "2024-02-28",
    "relevantLaws": [
      "Florida Motor Vehicle Safety Act",
      "Florida Deceptive and Unfair Trade Practices Act"
    ],
    "timeline": [
      {
        "date": "2024-01-05",
        "event": "Class action filed",
        "description": "Group of plaintiffs filed class action regarding electrical system"
      },
      {
        "date": "2024-02-10",
        "event": "Motion to dismiss",
        "description": "Bayersche filed motion to dismiss the class action"
      },
      {
        "date": "2024-02-28",
        "event": "Motion denied",
        "description": "Court denied motion to dismiss, case proceeding"
      }
    ],
    "offenseArgumentation": "The class action alleges that the electrical system in multiple Bayersche models has a defect that causes unexpected power loss. Plaintiffs claim this creates a safety hazard and that Bayersche concealed the issue.",
    "defenseArgumentation": "Our defense strategy is to challenge the class certification by demonstrating the diversity of electrical systems across different models and years. We are also gathering data to show the reported incidents are isolated and not indicative of a systemic defect.",
    "suggestions": [
      "Consider partial settlement for older models while contesting newer ones",
      "Develop stronger evidence of system improvements over time",
      "Emphasize the low incident rate compared to total vehicles sold"
    ],
    "outcomePrediction": {
      "cost": "$2,000,000 - $5,000,000",
      "reputationalLoss": "High",
      "winProbability": "45%"
    }
  },
  "5": {
    "id": "5",
    "title": "Garcia v. Bayersche Manufacturing",
    "status": "won",
    "jurisdiction": "Michigan",
    "caseType": "Liability",
    "date": "2023-11-05",
    "relevantLaws": [
      "Michigan Vehicle Code",
      "Michigan Consumer Protection Act"
    ],
    "timeline": [
      {
        "date": "2023-06-12",
        "event": "Initial complaint filed",
        "description": "Plaintiff alleged transmission defect"
      },
      {
        "date": "2023-07-18",
        "event": "Response filed",
        "description": "Bayersche filed response with counterclaims"
      },
      {
        "date": "2023-09-25",
        "event": "Expert testimony",
        "description": "Expert witnesses testified about transmission design"
      },
      {
        "date": "2023-10-30",
        "event": "Court ruling",
        "description": "Court ruled in favor of Bayersche"
      },
      {
        "date": "2023-11-05",
        "event": "Case closed",
        "description": "Case officially closed with favorable outcome"
      }
    ],
    "offenseArgumentation": "The plaintiff claimed that the transmission in their Model Z was defective, causing unexpected shifting and safety hazards. They argued that Bayersche was aware of the issue but failed to address it properly.",
    "defenseArgumentation": "Our defense successfully demonstrated that the transmission functioned as designed and that the plaintiff's issues were due to improper use of the vehicle. We presented extensive testing data and expert testimony to support our position.",
    "suggestions": [
      "Use similar technical evidence approach in future transmission cases",
      "Develop educational materials for customers about proper transmission use",
      "Consider proactive service bulletins for similar customer complaints"
    ],
    "outcomePrediction": {
      "cost": "$200,000 - $300,000",
      "reputationalLoss": "Low",
      "winProbability": "80%"
    }
  },
  "21-2093": {
    "id": "21-2093",
    "title": " individually and on \nbehalf of all others similarly situated \n \nv. \n \nBMW OF NORTH AMERICA",
    "status": "in progress",
    "jurisdiction": "United States District Court for the District of New Jersey",
    "caseType": "Breach of Contract",
    "harmType": "Financial harm",
    "cause": "Contract Breach",
    "description": "In the case of Gelis v. BMW of North America, LLC, the primary legal issue revolves around the financial implications of a class action settlement agreement concerning class counsel fees. The appellant, BMW, contends that the District Court's approval of a fee award at the upper limit of the agreed range constitutes a breach of the contractual terms established between the parties. To establish a breach of contract claim, the plaintiffs must demonstrate the existence of a valid contract, the breach of that contract by the defendant, and resultant damages. The burden of proof lies with the appellant to show that the fee award exceeded the agreed-upon limits or was otherwise unjustified under the terms of the settlement. Relevant legal standards include the principles of contract interpretation and enforcement, as well as precedents regarding the reasonableness of attorney fees in class action settlements.",
    "secondaryTypes": [],
    "possibleAlternatives": [],
    "date": "2017",
    "relevantLaws": [],
    "timeline": [
      {
        "date": "2025-04-26",
        "event": "Case created",
        "description": "Initial case documents uploaded"
      }
    ],
    "offenseArgumentation": "--- From artem_gelis_v._bmw_of_north_america_llc.pdf ---\n      PRECEDENTIAL \n \nUNITED STATES COURT OF APPEALS \nFOR THE THIRD CIRCUIT \n   \n \nNo. 21-2093 \n   \n \nARTEM V. GELIS; BHAWAR PATEL; ROBERT \nMCDONALD; JAMES V. OLSON; GREGORY HEYMAN; \nSUSAN HEYMAN; DEBRA P. WARD; DARRIAN \nSTOVALL; ALEX MARTINEZ; AMANDA GOREY; \nCHRIS WILLIAMS; AS HOK PATEL; KENNETH \nGAGNON; MICHAEL CERNY; MARIA MEZA; ANDRE \nMALSKE; NICOLE GUY; DAVID RICHARDSON; \nSTACEY TURNER; ERIC T. ZINN, individually and on \nbehalf of all others similarly situated \n \nv. \n \nBMW OF NORTH AMERICA, LLC, \n                                                                                                    \n      A p p e l l a n t  \n \n      \n \nAppeal from the United States District Court \nfor the District of New Jersey \n(D.C. Civil Action No. 2-17-cv-07386) \nMagistrate Judge: Cathy L. Waldor \n      \n  \n2 \n Argued on June 7, 2022 \n \nBefore:  AMBRO, RENDELL, and FUENTES, Circuit \nJudges \n(Opinion Filed: September 9, 2022) \n \n \nChristopher J. Dalton  (Argued)  \n550 Broad Street, Suite 810 Newark, NJ 07102  \nJacqueline M. Weyand \nBuchanan Ingersoll & Rooney 640 5th Avenue, 9th Floor  New York, NY 10019 \nCounsel for Appellant  \n Jay I. Brody \nGary S. Graifman   (Argued)  \nKantrowitz Goldhamer & Graifman 135 Chestnut Ridge Road, Suite 200 Montvale, NJ 07645  Randee Matloff Bruce H. Nagel   (Argued)  \nNagle Rice \n103 Eisenhower Parkway Roseland, NJ 07068 Thomas P. Sobran 7 Evergreen Lane Hingham, MA 02043 \nCounsel for Appellees \n3 \n    \n \nOPINION \n   \n AMBRO, Circuit Judge \n \nAfter the dust settles in a cl ass action lawsuit, lawyers \noften remain to squabble over class counsel fees.  Trying to avoid that fate, the parties here  made an agreement: Appellant \nBMW of North America, LLC w ould not object to an award \nup to $1,500,000, and class counsel would not request an award \nabove $3,700,000.  BMW now a ppeals the District Court’s \napproval of a fee award at the upper limit of that range.  It argues (1) that the Court’s cal culation of the “lodestar” \n(essentially a multiplication of the hours counsel reasonably \nbill on a case by a reasonable h ourly rate) was based on an \ninsufficient record, and (2) that the Court erred in applying a \nlodestar multiplier to the fee award.  We agree with BMW that \nthe lodestar was based on an insu fficient record and so vacate \nthe District Court’s judgment and remand for further proceedings.   \n \nI. Background \nThis appeal stems from the settlement of a consumer \nclass action suit filed in 2017  against BMW and its German \nparent,1 claiming they knowingly manufactured and sold \nvehicles equipped with defectiv e N20 and N26 engines.  After \nthe District Court granted in pa rt and denied in part BMW’s \n \n1 The parties later stipulated to the dismissal of BMW’s parent, \nBayerische Motoren Werke Aktienges ellschaft, as a defendant.   \n4 \n motion to dismiss, the named plaintiffs filed a Second \nConsolidated Amended Complaint bringing 20 causes of action under federal and state la w, including an alleged breach \nof warranty under the Magnuson-Moss Warranty Act, 15 \nU.S.C. § 2301 et seq.  (a federal fee-shifting statute), breach of \nthe implied warranty of merchantability, violation of various state consumer fraud and deceptiv e trade practice statutes, and \nunjust enrichment.   \n The parties subsequently engaged a mediator and \nreached a settlement to reimburs e class members for expenses \nincurred and provide them extende d warranties.   Because they \ndid not know how many consumers would be eligible or make \nclaims for certain benefits, the total value of the settlement was \nunknown.  The District Cour t nonetheless concluded it was \nworth at least $27 milli on.  As part of the settlement, the parties \n“agree[d] to submit the issue of at torneys’ fees” to a Magistrate \nJudge “for final evaluation and decision of the exact amount of \n. . . fees . . . that should reasona bly be awarded in this case.”  \nWhile the Court would have the final say, the parties decided \nto resolve the fee issu e with a “high-low” provision, stipulating \nthat  \n Settlement Class Counsel may apply to the Court for an award of attorneys’ fees . . . and [BMW] \nmay object to or oppose that application, \nalthough [BMW] will not object to Settlement \nClass Counsel’s application for an award of attorneys’ fees [of] . . . up to $1,500,0 00 in the \naggregate.  While not agreeing to the total amount of such an award, the Parties have agreed \nthat Settlement Class Counsel may apply for an  \n5 \n award of attorneys’ fees  . . . not to exceed \n$3,700,000 in the aggregate.   \nId.   \n Class counsel sought $3.7 m illion in attorneys’ fees, the \nmaximum allowable under the high-low provision, submitting \nto the Magistrate Judge three ch arts (one for each plaintiffs’ \nfirm) detailing at a summary le vel the time devoted to various \ncategories of legal work, aggr egated across the entire three-\nyear litigation period.   \n \n \n \n\n6 \n  \nId. at 218–19. \n \nId. at 241.  \n\n7 \n  \nId. at 254.  In addition, class counsel filed declarations that \nadded more detail about the work completed while still not specifying the time sp ent on particular tas ks, who did those \ntasks, or the dates they were performed, and d eclarations that \ndescribed the experience of each lawyer who billed for the \ncase.  BMW objected to the ma ximum fee request.  It argued, \namong other things, that (1) class counsel did not provide \nenough documentation to support the requested lodestar award, \nand (2) a lodestar multiplier (a fac tor by which a lodestar award \nis enhanced) was unwarranted here.   \n \n The Magistrate Judge held a telephonic hearing.  After listening to the parties’ arguments, the Court ruled that the summary charts were “m ore than sufficient”  and provided “a \ngood indicator of the time spent.”  Id. at 436.   Applying the \nlodestar approach, it adopted cla ss counsel’s requested lodestar \n\n8 \n amount of $1,934,000.  It th en applied class counsel’s \nrequested multiplier of 1.9 to re ach a total fee award of $3.7 \nmillion—the full amount class counsel sought.  BMW now appeals.  \n \nII. Standard of Review\n2 \nThough we lo ok anew (or de novo ) at the legal standards \nused by the Court to calculat e a fee award, “so long as it \nemploys correct standards and procedures and makes findings \nof fact [that are] not clearly erroneous,” a district court has \ndiscretion to decide the amount of an award.  In re Rite Aid \nCorp. Sec. Litig. , 396 F.3d 294, 299 (3d Cir. 2005) (quoting \nPub. Interest Research Grp.  of N.J., Inc. v. Windall , 51 F.3d \n1179, 1184 (3d Cir. 1995)).  We also  require that district courts \n“clearly set forth their reasoning fo r fee awards so that we will \nhave a sufficient basis to review for abuse of discretion.”  Id. \nat 301.   \nIII. Discussion \nA. Waiver of the right to appeal  the District Court’s fee \ndetermination  Before addressing the merits  of BMW’s arguments, we \naddress a threshold issue: whether BMW waived its right to \nappeal the District Court’s attorn eys’ fees ruling through (1) its \npurported judicial admissions, or (2) by agreeing to submit the issue of attorneys’ fees to the District Court “for final evaluation and decision,” Appx. at  199.  We conclude no.  \n \n2 The District Court had juri sdiction under the diversity \nprovision of the Class Action Fa irness Act of 2005, 28 U.S.C. \n§ 1332(d).  We have jurisdic tion under 28 U.S.C. § 1291. \n9 \n   \nAs to the former, class coun sel contends the “doctrine \nof ‘judicial admissions’” bars BMW’s appeal here.  Appellee \nBr. 24 n.18.  They point to an exchange between the Court and \nChristopher Dalton (BMW’s counsel) that occurred \nimmediately after it grante d class counsel’s motion for \nattorneys’ fees.  The Court asked Mr. Dalton if there was “anything you need—or I need to  put on the record for your \npurposes.”  Appx. at 437.  Mr. Dalton replied: “Your Honor has already gone through her ba ses and rationale for making \nthis determination.  We put it in the hands of the Court, and \nyou’ve made your decision, Judge.”  Id.   \n Case law requires that judicial admissions be \n“unequivocal” or “deliberate,  clear, and unambiguous.”   In re \nMotors Liquidation Co. , 957 F.3d 357, 360 (2d Cir. 2020) (per \ncuriam) (collecting cases).  As Mr. Dalton’s statements can be \nplausibly construed as merely acknowledging the adverse \nresult of the hearing, they do not meet this standard.   \n \nAlternatively, class counse l argues BMW waived its \nright to appeal by agreeing “to submit the issue of attorneys’ \nfees” to the Magistrate Judge “ for final evaluation  and \ndecision ” of the fee amount “within the $1,500,000 to \n$3,700,000 range agreed upon by the Parties.”  Appx. at 199 \n(emphasis added).  But the plai n language of this provision \ndoes not explicitly waive either party’s right to appeal.  Rather, it provides only that the District  Court would decide the issue \nafter briefing and argument,\n3 plus it is silent as to appellate \nrights.   \n \n3 Class counsel also points to non-published decisions from our \nCourt dealing with high-low fee provisions— Vargo v. \n10 \n  \nOur inquiry does not end here , however.  We must also \nconsider whether BMW waived its right to appeal by not explicitly reserving that right in the agreement.  To this, In re \nOdyssey Contracting Corp. , 944 F.3d 483 (3d Cir. 2019), is \ninstructive.  There we consider ed whether Odyssey waived its \nright to appeal a bankruptcy court’s determination of a payment dispute in an adversary proceeding.  It had signed a \nstipulation stating that if the Court made a certain determination, “all of the Par ties’ pending claims will be \nwithdrawn and disposed of in their entirety with prejudice,” \nand the proceeding “shall be deemed  to be finally concluded in \nall respects.”  Id. at 487–88.  The stipul ation was silent on the \nspecific right to appeal.  Id. at 488.  After the Bankruptcy Court \nmade the relevant determina tion, Odyssey appealed the \ndismissal of its claims to the Di strict Court and, eventually, our \nCourt.  Id. at 486.   We held Odyssey had waived its right to \nappeal because “the party seek ing to appeal must make its \nintent to do so clear at th e time of the stipulation.”  Id. at 489.   \n In that ruling we distingui shed the stipulation in \nOdyssey  from class action settlement cases in which other \n \nMangus , 94 F. App’x 941 (3d Cir. 2004), and Bryan v. Erie \nCnty. Off. of Children & Youth , 637 F. App’x 693 (3d Cir. \n2016)—and a New Jersey Supreme Court decision discussing high-low agreements in th e context of jury trials— Serico v. \nRothberg , 189 A.3d 343, 349–51 (N.J . 2018).  But because the \nattorneys’ fees provision at i ssue here does not include an \nunambiguous, explicit waiver of appeal, the Third Circuit cases \nfall off point.  Serico  is also out of place,  as it merely involved \nenforcing the upper bound of a high-low agreement according \nto the agreement’s plain language.  Id.  \n11 \n circuits have required express waiver of the right to appeal \nwhen the parties have stipulat ed that a court will decide a \ncertain issue.  Id. (citing In re Deepwater Horizon , 785 F.3d \n986, 997 (5th Cir. 2015); Montez v. Hickenlooper , 640 F.3d \n1126, 1132 (10th Cir. 20 11)).  We explained that “[t]he interest \nat stake in those cases was different from that at issue” in Odyssey  because “[i]n class actions, settlement agreements \ncannot be approved unless the c ourt determines that they are \nfundamentally fair, reasonable, and adequate, the purpose of which is to protect unnamed me mbers of the class from unjust \nor unfair settlements.”  Id. at 489–90 (interna l quotation marks \nomitted).  “[T]hat interest d[id] not apply in [ Odyssey ], which \ninvolve[d] a dispute between so phisticated business entities.”  \nId. at 490.   \n As our case presents a situati on closer to the class action \ncases distinguished in Odyssey , we  hold that stipulations \nregarding attorneys’ fees in class actions must contain an \nexpress waiver of appeal.  This tracks our case law in this area, \nwhich recognizes that the “unique relationship among \nplaintiffs’ counsel, plaintiffs, and defendants in class actions \nimposes a special responsibility upon appellate courts to hear challenges to fee awards.”  In re Cendant Corp. PRIDES Litig. , \n243 F.3d 722, 728 (3d Cir. 2001).  Because BMW did not \nexpressly waive its right to appeal the District Court’s fee \ndetermination, it preserved that right.  \n  \nB. Sufficiency of the record underlying the District \nCourt’s lodestar calculation  \n With waiver out of the way,  we turn to the merits.  \nBMW argues the District Court granted class counsel’s fee \nrequest on an insufficien t record.  We agree.  \n12 \n  \nFor context, there are two main ways to calculate \nattorneys’ fees: the percenta ge-of-recovery method and the \nlodestar method.  See Cendant , 243 F.3d at 732.  The former is \nas simple as it’s named.  “Lod estar,” though, is a term-of-art \nused by courts to denote an award that is “calculated by \nmultiplying the number of hours [the lawyer] reasonably worked on a client’s case by a reasonable hourly billing rate \nfor such services based on the given geographical area, the nature of the services provide d, and the experience of the \nattorney[].”  Rite Aid , 396 F.3d at 305.  These approaches are \ntypically employed in diffe rent contexts.  While the \n“percentage-of-recovery method is  generally favored in cases \ninvolving a common fund,” the lodestar method, pioneered by \nour Court in Lindy Brothers Builders, In c. of Philadelphia v. \nAmerican Radiator & St andard Sanitary Corp. , 487 F.2d 161 \n(3d Cir. 1973), “is more commonly applied in statutory fee-shifting cases . . . .”  In re Prudential Ins. Co. Am. Sales \nPractice Litig. , 148 F.3d 283, 333 (3d Cir. 1998).  The lodestar \napproach may also be used in cases, such as here, “where the \nnature of the recovery does not allow the determination of the \nsettlement’s value necessary for application of the percentage-\nof-recovery method.”\n4  Id.   \n As such, was the District Court’s calculation of the \nlodestar award based on a suffi cient record?  Our case law \nrequires that “[a]ny hours to be used in calculating attorneys’ \nfees . . . be detailed with sufficient specificity.”  Keenan v. City \nof Philadelphia , 983 F.2d 459, 472 (1992 ).  In other words, the \n \n4 As BMW does not challenge the District Court’s choice to \nuse the lodestar method, we do not question that aspect of its \nruling.  \n13 \n fee application must “be specifi c enough to allow the district \ncourt to determine if the hours claimed are unreasonable for the \nwork performed.”  Rode v. Dellarciprete , 892 F.2d 1177, 1190 \n(3d Cir. 1990) (inter nal quotation marks omitted).  The petition \nshould therefore “include ‘some fairly definite information as \nto the hours devoted to various ge neral activities, e. g.[,] pretrial \ndiscovery, settlement negotiations, and the hours spent by various classes of attorneys, e.g., senior partners, junior partners, associates.’”  Keenan , 983 F.2d at 473 (quoting Rode , \n892 F.2d at 1190).  “[I]t is not  necessary,” however, “to know \nthe exact number of minutes spent nor the precise activity to \nwhich each hour was devoted nor the specific attainments of \neach attorney.”  Rode , 892 F.2d at 1190 (internal quotation \nmarks omitted).   \n BMW argues the summary charts submitted by class \ncounsel cannot justify the award because they “do not detail in \nany explicit manner how the to tal hours worked . . . were \ngenerated.”  Appellant Br. at 14.  In particular, it contends the \ncharts “provided no dates to info rm the District Court of when \nthe task was performed; nor . . . information to show what any \nspecific activity was, how much time was devoted to any \nspecific activity, on any specific date, by which specific \nindividual, for a particular charge.”  Id. at 15 (citing Appx. at \n218–19, 241, 254) (emphases in  original).  As an initial \nobservation, we note that the summary charts total only three \npages  but purport to summarize hours billed across a three-\nyear period.  And while the charts  do provide some information \nabout the hours devoted to litigation activities (such as \n“Discovery Activities,” “Pre -Litigation Investigation,” \n“Drafting Complaints (original/amended)”), the hours billed \nby each attorney are aggregated across the entir e three-year \nlitigation period.  Appx. at 218–19 , 241, 254.  That sort of \n14 \n aggregation, without more detail, is an insufficient basis for an \nattorneys’ fee award.5  See Keenan , 983 F.2d at 473 (portion of \nfee petition consisting of summari es detailing “only monthly \ncumulative totals of [attorney’s] hours” wa s not “sufficiently \nspecific”).6  We simply cannot discern from the charts whether \ncertain hours are duplicative (a determination that is particularly crucial here, given that three plaintiffs’ firms seek fees for performing the same categories of work) or whether the total hours billed were reasona ble for the work performed.   \n In a last-ditch attempt to salvage the award, class \ncounsel asserts they “offer[ed] to  provide the [District Court] \nwith several hundred pages of contemporaneous billing \nrecords,” but it declined  the offer.  Appellees Br. at 30.  While \n \n5 Class counsel caution against re stricting our review to the \nsummary charts, pointing to, among other things, their \ndeclarations “describing discre te tasks engaged in by each \nfirm.”  Appellees Br. at 30.  But the declarations do not \nassociate the discrete tasks with  particular time-keepers or the \ntime spent on the tasks detailed therein.  More fundamentally, there is no way to use those declarations with the summary \ncharts (and other information pr ovided) to discern whether the \nhours reported by class counsel were reasonable for the work \nperformed.    \n6 BMW also argues the summary charts “do not comply with \nthe District of New Jersey’s re quirements for fee applications,” \nas laid out in that Court’s local rules.  See Appellant Br. at 30; \nD.N.J. L. Civ. R. 54.2.  Wh ile we may overturn a district \ncourt’s ruling for failing to abide by its own local rules in some \ncircumstances, see Advanced Fluid Systems, Inc. v. Huber , 958 \nF.3d 168, 181 (3d Cir. 2020), we need not reach this issue here, \nas we are overturning the fee aw ard on an altern ative ground.  \n15 \n not required, “contemporaneously  recorded time sheets are the \npreferred practice.”  Keenan , 983 F.2d at 472 (alteration \nadopted) (quoting Webb v. Cnty. Bd. of Educ. , 471 U.S. 234, \n238 n.6 (1985)).  And th at preference is especially strong here, \nwhere class counsel’s summary charts were so condensed, \nhigh-level, and lacking in specif ic detail that we would likely \nneed the underlying billing reco rds to parse them.  So class \ncounsel’s mere offer to provi de the District Court more \ndocumentation does not cure the Court’s failure to take counsel up on that offer and review th e complete records.  As its \nlodestar award was thus based on an insufficient record, we \nvacate its order and remand for further proceedings.    \n \nC. The propriety of applying a lodestar multiplier to \nthe fee award  \n BMW also argues the District  Court improperly applied \na lodestar multiplier to class counsel’s fee award.  It cites \nPerdue v. Kenny A. ex rel. Winn , in which the Supreme Court \nheld that “there is a ‘strong pr esumption’ that the lodestar \nfigure is reasonable, but that presumption may be overcome in \nthose rare circumstances in which the lodestar does not adequately take into account a factor that may properly be \nconsidered in determining a reas onable fee.”  559 U.S. 542, \n554 (2010).  Because Perdue concerned federal fee-shifting \nstatutes, id. at 547, the parties disagr ee about whether it applies \nhere.  Class counsel maintains Perdue does not govern, as our \nmatter “is not a pure statutory fee shifting case because it \nencompasses common law counts in cluding unjust enrichment, \nequitable relief claims, and breach of express and implied warranty counts which survived BMW[’s] motion to dismiss.”  \nAppellees Br. at 38.  BMW, on the other hand, contends \n“multipliers are inappropriate wh ere fees are based on a fee-\n16 \n shifting statute, determined by a lodestar calculation, as they \nwere here.”  Reply Br. at 11.  \n As we vacate and remand the District Court’s fee award \nbecause the lodestar calculati on was based on an insufficient \nrecord, we decline to decide whether the District Court was bound by the strictures of Perdue in considering a fee \nenhancement.  We do, however, no te two things for the parties \nand the Court to consider on remand.  First, we think the \nparties’ focus on the statutes un der which named plaintiffs sued \nis misplaced, as the “Court awarded the attorney’s fees \npursuant to a contract—the settlement agreement—not \npursuant to a statute.”  In re Home Depot Inc. , 931 F.3d 1065, \n1082 (11th Cir. 2019); see also Brytus v. Spang & Co. , 203 \nF.3d 238, 246 (3d Cir. 2000) (“When there has been a settlement, the basis for the stat utory fee has been discharged, \nand it is only the fund that remains.”).  Second, we urge the District Court on remand to provide additional reasoning for \nits decision whether to add a lodestar multiplier.  In the fee \nhearing, the Court explained it would add a multiplier of 1.9 \nbecause it “is well within approved multip liers in our \njurisdiction,” and because the award “falls well within the \nappropriate Gunter factors.”  Appx. at 437 (citing Gunter v. \nRidgewood Energy Corp. , 223 F.3d 190 (3d Cir. 2000)).  This \nis not enough reasoning to give us  “a sufficient basis to review” \nits fee enhancement.  Rite Aid , 396 F.3d at 301.   \n* * * \nIn their class action settleme nt the parties agreed to \ncabin class counsel’s attorneys’ fees reque st within a high-low \nrange, subject to final determina tion by the District Court.  \nThough it granted a fee award at the high end of that range, its \ncalculation was not supported by th e record before it.  Because \n17 \n we cannot tell whether the hour s class counsel billed were \nreasonable for the work performed,  we vacate the Court’s order \nand remand for furt her proceedings.   \n \n\n\n",
    "defenseArgumentation": null,
    "suggestions": [],
    "outcomePrediction": null,
    "defectType": [
      "Defective N20 and N26 engines"
    ],
    "numberOfClaimants": 15,
    "mediaCoverageLevel": {
      "level": "Not specified",
      "explanation": "Insufficient information to determine"
    },
    "outcome": "Settled",
    "timeToResolutionMonths": "Not specified",
    "settlementAmount": "At least $27 million",
    "defenseCostEstimate": "Not specified",
    "expectedBrandImpact": {
      "impact": "Medium",
      "explanation": "Given that the case involves a class action lawsuit against BMW for manufacturing and selling vehicles with defective engines, it is likely to have a medium impact on the brand. The settlement amount and the nature of the defects could lead to consumer distrust, but the resolution through a settlement may mitigate long-term damage."
    },
    "affectedCar": "Not specified",
    "affectedPart": "N20 and N26 engines",
    "brandImpactEstimate": {
      "impact": "Medium",
      "explanation": "The case's nature, involving defects in widely used engine models, suggests a potential medium impact on BMW's brand reputation. While the settlement may resolve immediate concerns, the underlying issues could linger in consumer perception."
    },
    "caseWinLikelihood": {
      "likelihood": "Low",
      "explanation": "The appeal by BMW indicates that they were not successful in the initial proceedings, and the settlement suggests that the plaintiffs had a strong case. Therefore, the likelihood of BMW winning the case appears low."
    },
    "plaintiffArgumentation": [
      "BMW knowingly manufactured and sold vehicles equipped with defective N20 and N26 engines",
      "Breach of warranty under the Magnuson-Moss Warranty Act",
      "Breach of the implied warranty of merchantability",
      "Violation of various state consumer fraud and deceptive trade practice statutes",
      "Unjust enrichment"
    ]
  }
}